; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v5 ?v3)
             (pred_10 ?v11 ?v10)
             (pred_9 ?v5 ?v10)
             (pred_3 ?v1 ?v5 )
	     (pred_5 ?v5)
             (pred_8 ?v12)
             (pred_4 ?v11)
             (pred_11 ?v10)
             (pred_7 ?v5)
             (pred_2 ?v11)
             (pred_6 ?v5)
             (pred_12 ))



(:action op_5
:parameters (?v6 ?v8 ?v4 ?v13)
:precondition (and (pred_8 ?v6) (pred_8 ?v8) (pred_4 ?v4) (pred_11 ?v13)
          (pred_1 ?v6 ?v8) (pred_10 ?v4 ?v13)
                   (pred_9 ?v8 ?v13) (pred_5 ?v6) 
                   (pred_7 ?v8) (pred_2 ?v4))
:effect (and  (pred_6 ?v8) (not (pred_7 ?v8))))


(:action op_1
:parameters (?v6 ?v7)
:precondition (and (pred_8 ?v6) (pred_8 ?v7)
               (pred_5 ?v6) (pred_1 ?v6 ?v7) (pred_6 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v6))))

(:action op_4
:parameters (?v6 ?v4)
:precondition (and (pred_8 ?v6) (pred_4 ?v4) 
                  (pred_5 ?v6) (pred_3 ?v4 ?v6) (pred_12 ))
:effect (and (pred_2 ?v4)
   (not (pred_3 ?v4 ?v6)) (not (pred_12 ))))


(:action op_2
:parameters (?v6 ?v9 ?v2)
:precondition (and (pred_8 ?v6) (pred_4 ?v9) (pred_4 ?v2)
                  (pred_5 ?v6) (pred_2 ?v2) (pred_3 ?v9 ?v6))
:effect (and (pred_2 ?v9) (pred_3 ?v2 ?v6)
        (not (pred_2 ?v2)) (not (pred_3 ?v9 ?v6))))

(:action op_3
:parameters (?v6 ?v4)
:precondition (and (pred_8 ?v6) (pred_4 ?v4) 
                  (pred_5 ?v6) (pred_2 ?v4))
:effect (and (pred_12 ) (pred_3 ?v4 ?v6) (not (pred_2 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_29 obj_12 obj_27 obj_06 obj_21 obj_32 obj_09 obj_24 obj_28 obj_31 obj_26 obj_08 obj_07 obj_30 obj_20 obj_15 obj_01 obj_03 obj_17 obj_04 obj_18 obj_22 obj_13 obj_02 obj_19
    obj_25 obj_11 obj_05
    obj_10 obj_14 obj_23 obj_16
    )

    (:init
       (pred_12)

       (pred_8 obj_29)
       (pred_8 obj_12)
       (pred_8 obj_27)
       (pred_8 obj_06)
       (pred_8 obj_21)
       (pred_8 obj_32)
       (pred_8 obj_09)
       (pred_8 obj_24)
       (pred_8 obj_28)
       (pred_8 obj_31)
       (pred_8 obj_26)
       (pred_8 obj_08)
       (pred_8 obj_07)
       (pred_8 obj_30)
       (pred_8 obj_20)
       (pred_8 obj_15)
       (pred_8 obj_01)
       (pred_8 obj_03)
       (pred_8 obj_17)
       (pred_8 obj_04)
       (pred_8 obj_18)
       (pred_8 obj_22)
       (pred_8 obj_13)
       (pred_8 obj_02)
       (pred_8 obj_19)
       (pred_11 obj_25)
       (pred_11 obj_11)
       (pred_11 obj_05)
       (pred_4 obj_10)
       (pred_4 obj_14)
       (pred_4 obj_23)
       (pred_4 obj_16)

       (pred_1 obj_29 obj_32)
       (pred_1 obj_29 obj_12)
       (pred_1 obj_12 obj_09)
       (pred_1 obj_12 obj_27)
       (pred_1 obj_12 obj_29)
       (pred_1 obj_27 obj_24)
       (pred_1 obj_27 obj_06)
       (pred_1 obj_27 obj_12)
       (pred_1 obj_06 obj_28)
       (pred_1 obj_06 obj_21)
       (pred_1 obj_06 obj_27)
       (pred_1 obj_21 obj_31)
       (pred_1 obj_21 obj_06)
       (pred_1 obj_32 obj_26)
       (pred_1 obj_32 obj_09)
       (pred_1 obj_32 obj_29)
       (pred_1 obj_09 obj_08)
       (pred_1 obj_09 obj_24)
       (pred_1 obj_09 obj_12)
       (pred_1 obj_09 obj_32)
       (pred_1 obj_24 obj_07)
       (pred_1 obj_24 obj_28)
       (pred_1 obj_24 obj_27)
       (pred_1 obj_24 obj_09)
       (pred_1 obj_28 obj_30)
       (pred_1 obj_28 obj_31)
       (pred_1 obj_28 obj_06)
       (pred_1 obj_28 obj_24)
       (pred_1 obj_31 obj_20)
       (pred_1 obj_31 obj_21)
       (pred_1 obj_31 obj_28)
       (pred_1 obj_26 obj_15)
       (pred_1 obj_26 obj_08)
       (pred_1 obj_26 obj_32)
       (pred_1 obj_08 obj_01)
       (pred_1 obj_08 obj_07)
       (pred_1 obj_08 obj_09)
       (pred_1 obj_08 obj_26)
       (pred_1 obj_07 obj_03)
       (pred_1 obj_07 obj_30)
       (pred_1 obj_07 obj_24)
       (pred_1 obj_07 obj_08)
       (pred_1 obj_30 obj_17)
       (pred_1 obj_30 obj_20)
       (pred_1 obj_30 obj_28)
       (pred_1 obj_30 obj_07)
       (pred_1 obj_20 obj_04)
       (pred_1 obj_20 obj_31)
       (pred_1 obj_20 obj_30)
       (pred_1 obj_15 obj_18)
       (pred_1 obj_15 obj_01)
       (pred_1 obj_15 obj_26)
       (pred_1 obj_01 obj_22)
       (pred_1 obj_01 obj_03)
       (pred_1 obj_01 obj_08)
       (pred_1 obj_01 obj_15)
       (pred_1 obj_03 obj_13)
       (pred_1 obj_03 obj_17)
       (pred_1 obj_03 obj_07)
       (pred_1 obj_03 obj_01)
       (pred_1 obj_17 obj_02)
       (pred_1 obj_17 obj_04)
       (pred_1 obj_17 obj_30)
       (pred_1 obj_17 obj_03)
       (pred_1 obj_04 obj_19)
       (pred_1 obj_04 obj_20)
       (pred_1 obj_04 obj_17)
       (pred_1 obj_18 obj_22)
       (pred_1 obj_18 obj_15)
       (pred_1 obj_22 obj_13)
       (pred_1 obj_22 obj_01)
       (pred_1 obj_22 obj_18)
       (pred_1 obj_13 obj_02)
       (pred_1 obj_13 obj_03)
       (pred_1 obj_13 obj_22)
       (pred_1 obj_02 obj_19)
       (pred_1 obj_02 obj_17)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_19 obj_02)
       (pred_7 obj_08)
       (pred_7 obj_29)
       (pred_7 obj_24)
       (pred_7 obj_01)
       (pred_9  obj_08 obj_25)
       (pred_9  obj_29 obj_11)
       (pred_9  obj_24 obj_05)
       (pred_9  obj_01 obj_25)
       (pred_6 obj_12)
       (pred_6 obj_27)
       (pred_6 obj_06)
       (pred_6 obj_21)
       (pred_6 obj_32)
       (pred_6 obj_09)
       (pred_6 obj_28)
       (pred_6 obj_31)
       (pred_6 obj_26)
       (pred_6 obj_07)
       (pred_6 obj_30)
       (pred_6 obj_20)
       (pred_6 obj_15)
       (pred_6 obj_03)
       (pred_6 obj_17)
       (pred_6 obj_04)
       (pred_6 obj_18)
       (pred_6 obj_22)
       (pred_6 obj_13)
       (pred_6 obj_02)
       (pred_6 obj_19)

       (pred_10  obj_10 obj_25)
       (pred_10  obj_14 obj_11)
       (pred_10  obj_23 obj_05)
       (pred_10  obj_16 obj_05)
       (pred_3 obj_10 obj_20)
       (pred_3 obj_14 obj_21)
       (pred_3 obj_23 obj_01)
       (pred_3 obj_16 obj_30)
       (pred_5 obj_26)
    )

    (:goal (and
       (pred_3 obj_16 obj_17)
    ))
(:constraints
  (always (not (pred_5 obj_03)))
)
)

; plan
1. (op_1 obj_26 obj_32)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_32)
   goals met: 0 of 1
2. (op_1 obj_32 obj_09)
   deleted: (pred_5 obj_32)
   added: (pred_5 obj_09)
   goals met: 0 of 1
3. (op_1 obj_09 obj_12)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_12)
   goals met: 0 of 1
4. (op_1 obj_12 obj_27)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_27)
   goals met: 0 of 1
5. (op_1 obj_27 obj_06)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_06)
   goals met: 0 of 1
6. (op_1 obj_06 obj_28)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_28)
   goals met: 0 of 1
7. (op_1 obj_28 obj_30)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_30)
   goals met: 0 of 1
8. (op_4 obj_30 obj_16)
   deleted: (pred_3 obj_16 obj_30) (pred_12)
   added: (pred_2 obj_16)
   goals met: 0 of 1
9. (op_1 obj_30 obj_17)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_17)
   goals met: 0 of 1
10. (op_3 obj_17 obj_16)
   deleted: (pred_2 obj_16)
   added: (pred_12) (pred_3 obj_16 obj_17)
   goals met: 1 of 1
